app/views/artists/show.html.erb

SELECT "releases".* FROM "releases" WHERE "releases"."artist_id" = 1
---
	<script type="text/javascript">
$(document).ready(function(){
  $('#bio a').attr('target', '_blank');
  		$("#artist-image").mouseover(function(){
				$("#share-bar").stop().animate({bottom : 0}, "slow");
			}).mouseout(function(){
				$("#share-bar").stop().animate({bottom : -25}, "slow");
			});
			$(".music-option").mouseover(function(){

				$(".dropdownContain").stop().fadeIn();

			}).mouseout(function(){
				$(".dropdownContain").stop().fadeOut();
			});
					$(".share-release").click(function() {
			$(this).closest(".each-release").find('.release-info').animate({bottom : -100}, "slow");
			$(this).closest(".each-release").find('.release-menu').animate({bottom : -25}, "slow");
			$(this).closest(".each-release").find('.r-grad').fadeOut("normal");
			$(this).closest(".each-release").find('.opac-50').fadeIn("normal");
			$(this).closest(".each-release").find('#share-release').animate({right : 0}, "slow");
		});