app/views/users/show.html.erb

	<ul>
  	<%= render :partial => 'users/activity', :collection => User.find(1).recent_activity %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]