app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists" WHERE (name LIKE '%skream%')
---
  def index
    if params[:search].blank?
      @empty_search = true
    elsif(params[:search].length < 2)
      @short_search = true
    else
      @search = params[:search].dup # Don't want the original string
      if @search["and "] then @search["and "] = "" end # remove ands from search
      if @search["& "] then @search["& "] = "" end # remove & from search
      @artists = Artist.search do

SELECT "artists".* FROM "artists" WHERE (name LIKE '%'Skream'%')
---
  def search
    @artists = Artist.search do

SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "follows".* FROM "follows" WHERE (user_id = '1' AND artist_id = '2')
---
  def show
    @artist = Artist.find(params[:id])
    @user = current_user
    @timeline = Timeline.artist(params[:id])
    respond_to do |format|
      format.html # show.html.erb
      format.json { render :json => @artist }
      format.js do
        @follow = current_user.follow .where(:artist_id => params[:id]).first

INSERT INTO "artists" ("bio", "booking_email", "created_at", "genre", "hometown", "label_id", "manager_email", "name", "soundcloud", "updated_at", "website", "youtube") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @artist = Artist.new(params[:artist])

    respond_to do |format|
      if @artist.save