app/controllers/labels_controller.rb

  def index
    @labels = Label.all
---
SELECT "labels".* FROM "labels"