app/controllers/releases_controller.rb

  def index
    @artist = Artist.find(params[:artist_id])
    @releases = @artist.releases.all
---
SELECT "releases".* FROM "releases"

  def show
    @artist = Artist.find(params[:artist_id])
    @release = @artist.releases.find(params[:id])
---
SELECT "releases".* FROM "releases" WHERE "releases"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @artist = Artist.find(params[:artist_id])
    @release = @artist.releases.build(params[:release])

    respond_to do |format|
      if @release.save
---
INSERT INTO "releases" ("amazon", "artist_id", "cat_no", "created_at", "date", "itunes", "name", "rls_type", "sdigital", "updated_at", "youtube") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)