app/controllers/users_controller.rb

  def show
    @friend = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def self
    api = Koala::Facebook::API.new(session["facebook_access_token"]["credentials"]["token"])
    @user = current_user
    @following = []
    if @user.managing.count > 0
      @artist = Artist.find(@user.managing.first.artist_id)
      @trackers = @artist.followed_users.count
    end
    @user.following.each do |artist|
      @following << Artist.find(artist.artist_id)
---
SELECT "artists".* FROM "artists" INNER JOIN "manages" ON "artists"."id" = "manages"."artist_id" WHERE "manages"."user_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "email_frequency", "first_name", "last_email", "last_name", "password", "role", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)